Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 8)                 0         
_________________________________________________________________
dense_1 (Dense)              (None, 300)               2700      
_________________________________________________________________
dense_2 (Dense)              (None, 200)               60200     
_________________________________________________________________
dense_5 (Dense)              (None, 4)                 804       
=================================================================
Total params: 63,704
Trainable params: 63,704
Non-trainable params: 0
_________________________________________________________________
