Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 8)                 0         
_________________________________________________________________
dense_3 (Dense)              (None, 500)               4500      
_________________________________________________________________
dense_4 (Dense)              (None, 500)               250500    
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 501       
=================================================================
Total params: 255,501
Trainable params: 255,501
Non-trainable params: 0
_________________________________________________________________
