Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 8)                 0         
_________________________________________________________________
dense_1 (Dense)              (None, 2000)              18000     
_________________________________________________________________
dense_2 (Dense)              (None, 1000)              2001000   
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 4004      
=================================================================
Total params: 2,023,004
Trainable params: 2,023,004
Non-trainable params: 0
_________________________________________________________________
