Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 8)                 0         
_________________________________________________________________
dense_1 (Dense)              (None, 2000)              18000     
_________________________________________________________________
dense_2 (Dense)              (None, 1000)              2001000   
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 1001      
=================================================================
Total params: 2,020,001
Trainable params: 2,020,001
Non-trainable params: 0
_________________________________________________________________
